Show / Hide Table of Contents
Class RebarStirrupPattern
Represents a pattern of rebar
Inheritance
System.Object
OpenObject
OpenElementId
RebarPatternBase
RebarStirrupPattern
Inherited Members
 RebarPatternBase.Relative
 RebarPatternBase.StartPosition
 RebarPatternBase.EndPosition
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RebarStirrupPattern,CI.StructuralElements", "CI.StructModel.Structure.IRebarStirrupPattern,CI.BasicTypes")]
public class RebarStirrupPattern : RebarPatternBase
Constructors
Improve this Doc   View Source
RebarStirrupPattern()
create a new instance.
Declaration
public RebarStirrupPattern()
Properties
Improve this Doc   View Source
AddFirstStirrup
true: add first stirrup for this pattern. used do exclude the first stirrup in patterns > first.
Declaration
public bool AddFirstStirrup { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Distance
Gets or sets the distance between rebars for this pattern.
Declaration
public double Distance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Translation
Gets or sets the local eccentricity in X and Y direction apply transfotmation at 3D (section 3D) then transform to 3D.
Declaration
public Vector3D Translation { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source